Revit 2026 API

# DirectShapeLibraryGetDirectShapeLibrary Method

---

Get the currently active Library object

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static DirectShapeLibrary GetDirectShapeLibrary(
	Document ADoc
)
```
```vb
Public Shared Function GetDirectShapeLibrary (
	ADoc As Document
) As DirectShapeLibrary
```
```cpp
public:
static DirectShapeLibrary^ GetDirectShapeLibrary(
	Document^ ADoc
)
```
```fsharp
static member GetDirectShapeLibrary :
        ADoc : Document -> DirectShapeLibrary
```

#### Parameters

ADoc Document

#### Return Value

DirectShapeLibrary

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

DirectShapeLibrary Class

Autodesk.Revit.DB Namespace